## Dataset Data bancaires

In [8]:
import pandas as pd
url= ("https://bit.ly/tx-data")
df = pd.read_csv(url)

df.shape()

TypeError: 'tuple' object is not callable

In [13]:
df.head()

  transaction_id first_name  last_name       ip_address   amount
0      50563-403     Jacobo   Haresign    18.144.134.48  $647.77
1     54569-3911    Christy       Derl  254.107.123.242  $460.47
2     59667-0024     Florie     Prewer    148.80.11.233  $565.38
3      60429-123     Danika     Shimuk   233.91.221.158  $794.76
4      0187-0771   Annelise  Antonescu   238.143.41.105  $790.41

- mask

In [15]:
import numpy as np

x = np.array([1, 2, 3, 4, 5])
#mask = np.array([False, False, True, False, True])

In [5]:
pair = x % 2 == 0
pair

array([False,  True, False,  True, False])

In [6]:
x[pair]

array([2, 4])

- Duplicatas

In [17]:
duplicatas = df.duplicated(keep=False,
                           subset=['transaction_id'])

In [23]:
df[duplicatas].sort_values('transaction_id').head()

   transaction_id first_name last_name       ip_address   amount
16      0066-0508       Jedd   Hartman     21.55.247.91  $749.96
42      0066-0508       Jedd   Hartman     21.55.247.91  $749.96
5       53942-299      Upton      Emig  103.190.123.125  $759.53
19      53942-299      Upton      Emig  103.190.123.125  $759.53
2      59667-0024     Florie    Prewer    148.80.11.233  $565.38

In [26]:
df.drop_duplicates(subset=['transaction_id'], inplace=True)